Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.NameKey
Name Key
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.CentroidVertical
Distance from centroid to the upper extremites along vertical axis.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.CentroidHorizontal
Distance from centroid to the left extremites along horizontal axis.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.Diameter
Pipe Diameter.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound
Defines common set of  parameters for structural section round contour.
Since:
2015